---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/User/Library/CloudStorage/OneDrive-Universidaddelosandes/2024-2 Evaluación de Políticas P
> úblicas/Talleres/taller5_grupo4.log
  log type:  text
 opened on:  13 Nov 2024, 23:02:32

. 
end of do-file

. do "/var/folders/k6/zwp5kf7x2n3bktdv3ftx57b80000gn/T//SD02734.000000"

. 
. log using "taller5_grupo4.log", replace /*Empezar el log file*/
log file already open
r(604);

end of do-file

r(604);

. do "/var/folders/k6/zwp5kf7x2n3bktdv3ftx57b80000gn/T//SD02734.000000"

. cls

. 
end of do-file

. do "/var/folders/k6/zwp5kf7x2n3bktdv3ftx57b80000gn/T//SD02734.000000"

. cd "/Users/User/Library/CloudStorage/OneDrive-Universidaddelosandes/2024-2 Evaluación de Políticas Pública
> s/Talleres"
/Users/User/Library/CloudStorage/OneDrive-Universidaddelosandes/2024-2 Evaluación de Políticas Públicas/Tall
> eres

. 
end of do-file

. do "/var/folders/k6/zwp5kf7x2n3bktdv3ftx57b80000gn/T//SD02734.000000"

. 
. use "Base_Taller_5_RD.dta", clear

. 
. *para Mac
. *use "./Base_Taller_5_RD.dta",clear 
. 
. 
. describe

Contains data from Base_Taller_5_RD.dta
 Observations:         9,666                  
    Variables:            20                  14 Jan 2018 16:09
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
Total_Persona~r byte    %10.0g                Total_Personas_Hogar, linea de base
sisben          double  %10.0g                puntaje de SISBEN
intervalo       float   %9.0g                 puntaje SISBEN - intervalos de uno
Ingresos_Jefe   long    %12.0g                Ingresos_Jefe, linea de base
Ingresos_Cony~e long    %12.0g                Ingresos_Conyuge, linea de base
Tiene_Alcanta~o float   %9.0g      yn         Tiene_Alcantarillado, linea de base
Tiene_Gas       float   %9.0g      yn         Tiene_Gas, linea de base
Tiene_Telefono  float   %9.0g      yn         Tiene_Telefono, linea de base
Tiene_Recolec~a float   %9.0g      yn         Tiene_Recoleccion_Basura, linea de base
Tiene_Acueducto float   %9.0g      yn         Tiene_Acueducto, linea de base
Dueno_Vivienda  float   %9.0g      yn         Dueño Vivienda, linea de base
Sanitario_Den~o float   %9.0g      yn         Sanitario_Dentro, linea de base
Tiene_Ducha     float   %9.0g      yn         Tiene_Ducha, linea de base
Tiene_Nevera    float   %9.0g      yn         Tiene_Nevera, linea de base
Jefe_Secundar~a float   %9.0g      yn         Jefe_Secundaria_Completa, linea de base
beneficiario    float   %9.0g      yn         Recibe programa Familias en Acción
asistencia      float   %9.0g      yn         Niños 7-17 asisten al colegio
tinfantil       float   %9.0g      yn         Trabajo infantil en el hogar
empleojefe      float   %9.0g      yn         Jefe del hogar con empleo
empleocony      float   %9.0g      yn         Conyuge del jefe del hogar con empleo
---------------------------------------------------------------------------------------------------------------
Sorted by: 

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
Total_Pers~r |      9,666    5.387751    2.080747          1         21
      sisben |      9,666    11.04615    1.700944       2.93      20.77
   intervalo |      9,666    11.01873    1.670384        2.5       20.5
Ingresos_J~e |      9,666    254889.8    148701.5          0    1500000
Ingresos_C~e |      9,666    73586.34    128212.2          0     600000
-------------+---------------------------------------------------------
Tiene_Alca~o |      9,666    .7936065    .4047372          0          1
   Tiene_Gas |      9,666    .5703497    .4950518          0          1
Tiene_Tele~o |      9,666    .6321126    .4822555          0          1
Tiene_Reco~a |      9,666    .9928616    .0841914          0          1
Tiene_Acue~o |      9,666    .8087109    .3933364          0          1
-------------+---------------------------------------------------------
Dueno_Vivi~a |      9,666    .3885785    .4874524          0          1
Sanitario_~o |      9,666    .7619491    .4259125          0          1
 Tiene_Ducha |      9,666    .9441341    .2296745          0          1
Tiene_Nevera |      9,666    .4590317    .4983445          0          1
Jefe_Secun~a |      9,590    .3460897     .475747          0          1
-------------+---------------------------------------------------------
beneficiario |      9,666    .3942686    .4887183          0          1
  asistencia |      3,232    .9306931    .2540147          0          1
   tinfantil |      3,232    .0266089    .1609624          0          1
  empleojefe |      1,996    .7925852    .4055568          0          1
  empleocony |      1,381    .4149167    .4928861          0          1

. 
. * Punto 3- Gráfica de covariables del hogar medidas en linea de base alrededor del punto de corte -----------
> -----------------------------------------
. 
. egen prop_Alcantarillado = mean(Tiene_Alcantarillado), by(intervalo)

. label var prop_Alcantarillado "Proporción de hogares con alcantarillado"

. 
. scatter prop_Alcantarillado intervalo, msymbol(oh) mlcolor(gs1) ///
>        || lowess prop_Alcantarillado sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>        || lowess prop_Alcantarillado sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) /
> //
>        ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>        legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>        xtitle("Intervalo de Sisbén") ytitle("Proporción de hogares con alcantarillado") ///
>        title("Acceso a alcantarillado por intervalo de Sisbén")

. graph save "graph3.1.gph", replace
file graph3.1.gph saved

. egen prop_Nevera = mean(Tiene_Nevera), by(intervalo)

. label var prop_Nevera "Proporción de hogares con nevera"

. 
. scatter prop_Nevera intervalo, msymbol(oh) mlcolor(gs1) ///
>     || lowess prop_Nevera sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     || lowess prop_Nevera sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>     legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>     xtitle("Intervalo de Sisbén") ytitle("Proporción de hogares con nevera") ///
>     title("Propiedad de nevera por intervalo de Sisbén")

. graph save "graph3.2.gph", replace
file graph3.2.gph saved

. 
. egen prop_Secundaria = mean(Jefe_Secundaria_Completa), by(intervalo)

. label var prop_Secundaria "Proporción de jefes con secundaria completa"

. 
. scatter prop_Secundaria intervalo, msymbol(oh) mlcolor(gs1) ///
>     || lowess prop_Secundaria sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     || lowess prop_Secundaria sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>     legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>     xtitle("Intervalo de Sisbén") ytitle("Proporción de jefes con secundaria completa") ///
>     title("Nivel educativo del jefe de hogar por intervalo de Sisbén")

. graph save "graph3.3.gph", replace
file graph3.3.gph saved

. 
. egen prop_Recoleccion = mean(Tiene_Recoleccion_Basura), by(intervalo)

. label var prop_Recoleccion "Proporción de recolección de basura"

. 
. scatter prop_Recoleccion intervalo, msymbol(oh) mlcolor(gs1) ///
>     || lowess prop_Recoleccion sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     || lowess prop_Recoleccion sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>     legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>     xtitle("Intervalo de Sisbén") ytitle("Proporción de recolección de basura") ///
>     title("Recolección de basura por intervalo de Sisbén")

. graph save "graph3.4.gph",replace
file graph3.4.gph saved

. 
. /*egen prop_Asistencia = mean(asistencia), by(intervalo)
> label var prop_Asistencia "Proporción de niños que asisten al colegio"
> 
> scatter prop_Asistencia intervalo, msymbol(oh) mlcolor(gs1) ///
>     || lowess prop_Asistencia sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     || lowess prop_Asistencia sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>     ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>     legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>     xtitle("Intervalo de Sisbén") ytitle("Proporción de niños que asisten al colegio") ///
>     title("Asistencia escolar de niños por intervalo de Sisbén")
> graph save "graph3.4.gph",replace*/
. 
. graph combine graph3.1.gph graph3.2.gph graph3.3.gph graph3.4.gph, ///
>     cols(2) ///
>     title("Gráficas combinadas: Acceso a servicios y educación por intervalo de Sisbén") ///
>     ysize(6) xsize(12)

. graph save "graph3.gph",replace
file graph3.gph saved

. 
. * Punto 4- Estimación de las diferencias observadas en las gráficas para las características de balance -----
> -----------------------------------------------
. *Configurar el punto de corte como 0
. 
. {
. gen sisben_std = sisben - 11
.         
. *ssc install rdrobust,replace
. *ssc install rddensity, replace
. *ssc install lpdensity, replace
. 
. *Característica de balance: Acceso a alcantarillado
. *Sin Fuzzy, sin controles -sin covariables mas adelante y fuzzy
. eststo: rdrobust Tiene_Alcantarillado sisben_std,  c(0) h(5) 

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       9666
-------------------+----------------------            BW type       =     Manual
     Number of obs |      4964        4702            Kernel        = Triangular
Eff. Number of obs |      4836        4617            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: Tiene_Alcantarillado. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01658      .0129   -1.2859  0.198   -.041859      .008693
            Robust |     -          -     -2.0874  0.037   -.067543     -.002127
--------------------------------------------------------------------------------
(est25 stored)
. est sto r1 
. 
. *rdrobust Tiene_Alcantarillado sisben_std, fuzzy(beneficiario) covs(Tiene_Recoleccion_Basura  Tiene_Nevera Je
> fe_Secundaria_Completa) c(0) h(5) all//no sig
. 
. 
. *Característica de balance: Propietario de nevera
. eststo: rdrobust Tiene_Nevera sisben_std, c(0) h(5) 

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       9666
-------------------+----------------------            BW type       =     Manual
     Number of obs |      4964        4702            Kernel        = Triangular
Eff. Number of obs |      4836        4617            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: Tiene_Nevera. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00377     .01682   -0.2243  0.823   -.036742      .029196
            Robust |     -          -     -0.1569  0.875   -.046154      .039312
--------------------------------------------------------------------------------
(est26 stored)
. est sto r2
. *rdrobust Tiene_Nevera sisben_std, fuzzy(beneficiario) covs(Tiene_Alcantarillado Tiene_Recoleccion_Basura Jef
> e_Secundaria_Completa) c(0) h(5) all //no sig.
. 
. 
. *Característica de balance: Nivel educativo jefes de familia
. eststo: rdrobust Jefe_Secundaria_Completa sisben_std,  c(0) h(5) //7% más sig al 99%

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       9590
-------------------+----------------------            BW type       =     Manual
     Number of obs |      4937        4653            Kernel        = Triangular
Eff. Number of obs |      4809        4568            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: Jefe_Secundaria_Completa. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0425     .01593   -2.6679  0.008    -.07373     -.011278
            Robust |     -          -     -4.0168  0.000   -.122728     -.042236
--------------------------------------------------------------------------------
(est27 stored)
. est sto r3
. 
. *rdrobust Jefe_Secundaria_Completa sisben_std, fuzzy(beneficiario) covs(Tiene_Alcantarillado Tiene_Recoleccio
> n_Basura Tiene_Nevera ) c(0) h(5) all //7% más sig al 99%
. 
. 
. *Característica de balance: Asistencia a clases
. eststo: rdrobust Tiene_Recoleccion_Basura sisben_std, c(0) h(5) 

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       9666
-------------------+----------------------            BW type       =     Manual
     Number of obs |      4964        4702            Kernel        = Triangular
Eff. Number of obs |      4836        4617            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: Tiene_Recoleccion_Basura. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01054     .00413   -2.5522  0.011   -.018642     -.002447
            Robust |     -          -     -3.4869  0.000   -.035963     -.010082
--------------------------------------------------------------------------------
(est28 stored)
. est sto r4
. 
. *rdrobust Tiene_Recoleccion_Basura sisben_std, fuzzy(beneficiario) covs(Tiene_Nevera Jefe_Secundaria_Completa
>  Tiene_Alcantarillado) c(0) h(5) all //1.4% al 95%
. 
. *Exportacion de resultados
. esttab r* , b(3) se(3) star(* 0.10 * 0.05 ** 0.01) stats(N  N_h_l N_h_r), using "Punto4.doc", rtf replace
(output written to Punto4.doc)
. 
. }

. 
. * Punto 5- Gráfica de las variables de resultado contra el puntaje Sisbén -----------------------------------
> -----------------
. 
. egen prop_Empleojefe = mean(empleojefe), by(intervalo)

. label var prop_Empleojefe "Proporción de hogares cuyo jefe de hogar tiene empleo"

. 
. scatter prop_Empleojefe intervalo, msymbol(oh) mlcolor(gs1) ///
>        || lowess prop_Empleojefe sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>        || lowess prop_Empleojefe sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>        ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>        legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>        xtitle("Intervalo de Sisbén") ytitle("Proporción de hogares cuyo jefe de hogar tiene empleo") ///
>        title("Empleo de jefes de hogar por intervalo de Sisbén")

. graph save "graph5.1.gph", replace
(file graph5.1.gph not found)
file graph5.1.gph saved

. 
. egen prop_tinfantil = mean(tinfantil), by(intervalo)
(5 missing values generated)

. label var prop_tinfantil "Proporción de hogares en los que algún niño o niña trabaja"

. 
. scatter prop_tinfantil intervalo, msymbol(oh) mlcolor(gs1) ///
>        || lowess prop_tinfantil sisben if sisben<=11, bw(.6) lcolor(gs6) clwidth(medthick) ///
>        || lowess prop_tinfantil sisben if sisben>11 & sisben<=21, bw(.6) lcolor(gs6) clwidth(medthick) ///
>        ||, xline(11) xlabel(0(1)21) ylabel(, glcolor(gs14) glwidth(thin)) ///
>        legend(position(8) ring(0) cols(1) row(1) order(1 2)) ///
>        xtitle("Intervalo de Sisbén") ytitle("Proporción de hogares en los que algún niño o niña trabaja") ///
>        title("Empleo de niños y niñas en el hogar por intervalo de Sisbén")

. graph save "graph5.2.gph", replace
(file graph5.2.gph not found)
file graph5.2.gph saved

. 
. graph combine graph5.1.gph graph5.2.gph, ///
>     cols(2) ///
>     title("Gráficas combinadas: Empleo de jefes de hogar y Empleo de niños y niñas en el hogar, por intervalo
>  de Sisbén") ///
>     ysize(6) xsize(12)

. graph save "graph5.gph", replace 
(file graph5.gph not found)
file graph5.gph saved

. 
. 
. *Punto 6 - Estime el impacto en las dos variables de resultado para anchos de banda de h=5 y h=10. ITT
. cls

.  
. *jefe de hogar
. eststo: rdrobust empleojefe sisben_std,  c(0) h(5)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1996
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1017         979            Kernel        = Triangular
Eff. Number of obs |       991         962            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: empleojefe. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04773     .03525   1.3539   0.176   -.021363      .116818
            Robust |     -          -     0.6882   0.491   -.058848      .122534
--------------------------------------------------------------------------------
(est29 stored)

. est sto r111

. 
. eststo: rdrobust empleojefe sisben_std,  c(0) h(10)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1996
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1017         979            Kernel        = Triangular
Eff. Number of obs |      1017         979            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    10.000      10.000
       BW bias (b) |    10.000      10.000
         rho (h/b) |     1.000       1.000

Outcome: empleojefe. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03846     .02867   1.3414   0.180   -.017733       .09465
            Robust |     -          -     1.2507   0.211    -.02796      .126565
--------------------------------------------------------------------------------
(est30 stored)

. est sto r222

. 
. *Trabajo infantil
. eststo: rdrobust tinfantil sisben_std, c(0) h(5)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3232
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1692        1540            Kernel        = Triangular
Eff. Number of obs |      1661        1525            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

Outcome: tinfantil. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00917     .01138   0.8056   0.420   -.013135      .031469
            Robust |     -          -     1.1522   0.249   -.012571      .048429
--------------------------------------------------------------------------------
(est31 stored)

. est sto r333

. 
. *Trabajo infantil
. eststo: rdrobust tinfantil sisben_std,  c(0) h(10)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3232
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1692        1540            Kernel        = Triangular
Eff. Number of obs |      1692        1540            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    10.000      10.000
       BW bias (b) |    10.000      10.000
         rho (h/b) |     1.000       1.000

Outcome: tinfantil. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0117     .00969   1.2079   0.227   -.007284      .030683
            Robust |     -          -     0.6287   0.530   -.017324      .033688
--------------------------------------------------------------------------------
(est32 stored)

. est sto r444

. 
. esttab r111 r222 r333 r444 , b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) stats(N  N_h_l N_h_r) , using "Punto6.d
> oc", rtf replace
(output written to Punto6.doc)

. 
. 
. *Punto 7 -Escriba la ecuación (o ecuaciones) para estimar el efecto local promedio de recibir FeA 
. *jefe de hogar
. eststo:rdrobust empleojefe sisben_std, fuzzy(beneficiario) c(0) h(5)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1996
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1017         979            Kernel        = Triangular
Eff. Number of obs |       991         962            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: beneficiario. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.69981     .02784   -25.1403 0.000   -.754368     -.645252
            Robust |     -          -     -17.2621 0.000   -.689907     -.549215
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: empleojefe. Running variable: sisben_std. Treatment Status: beneficiario.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0682     .05024   -1.3574  0.175   -.166676      .030274
            Robust |     -          -     -0.8092  0.418   -.182479      .075833
--------------------------------------------------------------------------------
(est33 stored)

. est sto r555

. 
. eststo:rdrobust empleojefe sisben_std, fuzzy(beneficiario)  c(0) h(10)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1996
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1017         979            Kernel        = Triangular
Eff. Number of obs |      1017         979            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    10.000      10.000
       BW bias (b) |    10.000      10.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: beneficiario. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.73619     .02333   -31.5614 0.000   -.781905      -.69047
            Robust |     -          -     -22.1800 0.000   -.752797     -.630555
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: empleojefe. Running variable: sisben_std. Treatment Status: beneficiario.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05224     .03889   -1.3433  0.179   -.128458      .023979
            Robust |     -          -     -1.3126  0.189   -.174847       .03459
--------------------------------------------------------------------------------
(est34 stored)

. est sto r666

. 
. *Trabajo infantil
. eststo:rdrobust tinfantil sisben_std, fuzzy(beneficiario)  c(0) h(5)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3232
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1692        1540            Kernel        = Triangular
Eff. Number of obs |      1661        1525            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     5.000       5.000
       BW bias (b) |     5.000       5.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: beneficiario. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.71418     .01899   -37.5990 0.000   -.751408      -.67695
            Robust |     -          -     -25.2132 0.000   -.657443     -.562602
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: tinfantil. Running variable: sisben_std. Treatment Status: beneficiario.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01284     .01594   -0.8053  0.421   -.044074      .018403
            Robust |     -          -     -1.2377  0.216   -.069695      .015742
--------------------------------------------------------------------------------
(est35 stored)

. est sto r777

. 
. eststo:rdrobust tinfantil sisben_std, fuzzy(beneficiario)  c(0) h(10)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3232
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1692        1540            Kernel        = Triangular
Eff. Number of obs |      1692        1540            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    10.000      10.000
       BW bias (b) |    10.000      10.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: beneficiario. Running variable: sisben_std.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.75518     .01657   -45.5862 0.000   -.787651     -.722714
            Robust |     -          -     -32.5297 0.000   -.730524     -.647496
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: tinfantil. Running variable: sisben_std. Treatment Status: beneficiario.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01549     .01283   -1.2075  0.227   -.040639      .009655
            Robust |     -          -     -0.7071  0.479   -.045983        .0216
--------------------------------------------------------------------------------
(est36 stored)

. est sto r888

. 
. esttab r555 r666 r777 r888 , b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) stats(N  N_h_l N_h_r) , using "Punto7.d
> oc", rtf replace
(output written to Punto7.doc)

. 
. 
. *Bono - NO manipulación
. *1er métdodo
. kdensity sisben_std, xline(0,lcol(red) lp("--")) lcol(black)    

. 
. *Segundo mètodo
.         rddensity sisben_std
Computing data-driven bandwidth selectors.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option nomasspoints to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

     c =     0.000 | Left of c  Right of c          Number of obs =         9666
-------------------+----------------------          Model         = unrestricted
     Number of obs |      4964        4702          BW method     =         comb
Eff. Number of obs |      1876         813          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     0.622       0.468

Running variable: sisben_std.
------------------------------------------
            Method |      T          P>|T|
-------------------+----------------------
            Robust |   -6.2755      0.0000
------------------------------------------

P-values of binomial tests. (H0: prob = .5)
-----------------------------------------------------
 Window Length / 2 |       <c         >=c |     P>|T|
-------------------+----------------------+----------
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
-----------------------------------------------------

.         rddensity sisben_std, plot  graph_opt(title("Test de manipulación")                                  
>   ///
>                 xtitle("Clasificación de SISBEN 1")                                    ///
>                 ytitle("Densidad de la variable de focalización")                                            
>   ///
>                 scheme(s1mono) legend(off) graphregion(fcolor(white))) 
Computing data-driven bandwidth selectors.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option nomasspoints to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

     c =     0.000 | Left of c  Right of c          Number of obs =         9666
-------------------+----------------------          Model         = unrestricted
     Number of obs |      4964        4702          BW method     =         comb
Eff. Number of obs |      1876         813          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     0.622       0.468

Running variable: sisben_std.
------------------------------------------
            Method |      T          P>|T|
-------------------+----------------------
            Robust |   -6.2755      0.0000
------------------------------------------

P-values of binomial tests. (H0: prob = .5)
-----------------------------------------------------
 Window Length / 2 |       <c         >=c |     P>|T|
-------------------+----------------------+----------
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
             0.000 |        0          35 |    0.0000
-----------------------------------------------------

.         
. log close
      name:  <unnamed>
       log:  /Users/User/Library/CloudStorage/OneDrive-Universidaddelosandes/2024-2 Evaluación de Políticas P
> úblicas/Talleres/taller5_grupo4.log
  log type:  text
 closed on:  13 Nov 2024, 23:03:09
---------------------------------------------------------------------------------------------------------------
