-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Heitz\Desktop\Evaluación de Impacto  EGOB\Taller 6\taller6_grupo4final.log
  log type:  text
 opened on:  25 Nov 2024, 21:21:32

. 
. *Cargamos la base de datos
. use "Base_Taller_DD", clear

. 
. *Corremos las instrucciones iniciales
. sort llavefin

. br

. *Estadisticas descriptivas de la base
. sum tratamiento,d

                 Recibe Familias en Acción
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              28,731
25%            0              0       Sum of wgt.      28,731

50%            1                      Mean           .5886325
                        Largest       Std. dev.      .4920901
75%            1              1
90%            1              1       Variance       .2421527
95%            1              1       Skewness      -.3602349
99%            1              1       Kurtosis       1.129769

. sum seguimiento,d

         Primer seguimiento (tiempo 2 de medición)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              28,731
25%            0              0       Sum of wgt.      28,731

50%            0                      Mean           .4674394
                        Largest       Std. dev.      .4989474
75%            1              1
90%            1              1       Variance       .2489485
95%            1              1       Skewness       .1305196
99%            1              1       Kurtosis       1.017035

. tab tratamiento

     Recibe |
Familias en |
     Acción |      Freq.     Percent        Cum.
------------+-----------------------------------
       0 No |     11,819       41.14       41.14
       1 Si |     16,912       58.86      100.00
------------+-----------------------------------
      Total |     28,731      100.00

. tab seguimiento

     Primer |
seguimiento |
  (tiempo 2 |
         de |
  medición) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,301       53.26       53.26
          1 |     13,430       46.74      100.00
------------+-----------------------------------
      Total |     28,731      100.00

. 
. * Punto 1.b --------------------------------------------------------------------
. /* b)   Estime el efecto de FeA utilizando el método de Diferencias en Diferencias 
> sobre el trabajo infantil utilizando dos variables de resultado: 1) (10%) el tiempo
>  que dedican los niños a trabajar por fuera del hogar, y 2) (10%) en el tiempo que
> dedican los niños a ayudar en las labores del hogar. Presente e interprete los 
> resultados de cada estimación. 
> 
> */
. 
. *Generamos la variable de la interaccion
. gen interaccion = tratamiento*seguimiento

. 
. *regresion var 1 
. eststo:reg ttrabajo tratamiento seguimiento interaccion, r

Linear regression                               Number of obs     =     28,731
                                                F(3, 28727)       =      46.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0052
                                                Root MSE          =     1.6598

------------------------------------------------------------------------------
             |               Robust
    ttrabajo | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tratamiento |    .246977   .0275085     8.98   0.000     .1930589     .300895
 seguimiento |  -.0331778   .0294965    -1.12   0.261    -.0909922    .0246367
 interaccion |  -.2192238   .0393635    -5.57   0.000    -.2963781   -.1420694
       _cons |   1.108883   .0202063    54.88   0.000     1.069277    1.148488
------------------------------------------------------------------------------
(est1 stored)

. est sto r1 

. *regresion var 2
. eststo: reg tayuda tratamiento seguimiento interaccion, r

Linear regression                               Number of obs     =     28,731
                                                F(3, 28727)       =       7.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0008
                                                Root MSE          =     2.1718

------------------------------------------------------------------------------
             |               Robust
      tayuda | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tratamiento |   .0449619   .0339368     1.32   0.185    -.0215557    .1114796
 seguimiento |   .1837365     .04128     4.45   0.000     .1028258    .2646472
 interaccion |  -.1252272   .0529189    -2.37   0.018    -.2289506   -.0215037
       _cons |   .5196128   .0256802    20.23   0.000     .4692785    .5699471
------------------------------------------------------------------------------
(est2 stored)

. est sto r2

. 
. *Exportacion de resultados
. esttab r1 r2 , b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) stats(N r2), using "Punto1b.doc", rtf replace
(output written to Punto1b.doc)

. 
. 
. * Punto 1.c --------------------------------------------------------------------
. /* c)   (10%) Estime de nuevo el modelo para cada variable de resultado incluyendo
>  también como variables de control los activos netos y el número de bienes durables
>  del hogar. Observe si cambió el coeficiente que mide el efecto del programa. 
>  Comente por qué cambió o no cambió.
> */
. 
. *regresion  var 1 con controles
. eststo: reg ttrabajo tratamiento seguimiento interaccion activos durables,r

Linear regression                               Number of obs     =     28,433
                                                F(5, 28427)       =      52.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0092
                                                Root MSE          =     1.6563

------------------------------------------------------------------------------
             |               Robust
    ttrabajo | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tratamiento |   .2394326   .0276374     8.66   0.000      .185262    .2936031
 seguimiento |  -.0366137   .0296239    -1.24   0.216     -.094678    .0214506
 interaccion |  -.2234871   .0394912    -5.66   0.000    -.3008917   -.1460825
     activos |   3.68e-09   2.64e-09     1.39   0.163    -1.50e-09    8.86e-09
    durables |   -.075588   .0070981   -10.65   0.000    -.0895006   -.0616754
       _cons |   1.248342   .0252349    49.47   0.000      1.19888    1.297803
------------------------------------------------------------------------------
(est3 stored)

. est sto r3

. *regresion var 2 con controles
. eststo: reg tayuda tratamiento seguimiento interaccion activos durables,r

Linear regression                               Number of obs     =     28,433
                                                F(5, 28427)       =      25.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0043
                                                Root MSE          =     2.1662

------------------------------------------------------------------------------
             |               Robust
      tayuda | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tratamiento |    .029769   .0340409     0.87   0.382    -.0369528    .0964909
 seguimiento |   .1818348   .0415741     4.37   0.000     .1003476     .263322
 interaccion |  -.1302665   .0531482    -2.45   0.014    -.2344396   -.0260934
     activos |   9.04e-10   1.43e-09     0.63   0.526    -1.89e-09    3.70e-09
    durables |  -.0925273   .0090493   -10.22   0.000    -.1102644   -.0747902
       _cons |   .6896679   .0319373    21.59   0.000     .6270693    .7522665
------------------------------------------------------------------------------
(est4 stored)

. est sto r4

. 
. 
. *Exportacion de resultados
. esttab r3 r4 , b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) stats(N r2), using "Punto1b.doc", rtf replace
(output written to Punto1b.doc)

. 
. 
. * Crear variables para promedios por grupo y período
. gen mean_ttrabajo = .
(28,731 missing values generated)

. gen mean_tayuda = .
(28,731 missing values generated)

. 
. 
. *Un intento de gráficas de tendencias paralelas, pero al ser dos periodos no 
. *son concluyentes.
. * Calcular promedios por período y grupo
. foreach var in ttrabajo tayuda {
  2.     qui sum `var' if seguimiento == 0 & tratamiento == 1
  3.     replace mean_`var' = r(mean) if seguimiento == 0 & tratamiento == 1
  4.     
.     qui sum `var' if seguimiento == 1 & tratamiento == 1
  5.     replace mean_`var' = r(mean) if seguimiento == 1 & tratamiento == 1
  6. 
.     qui sum `var' if seguimiento == 0 & tratamiento == 0
  7.     replace mean_`var' = r(mean) if seguimiento == 0 & tratamiento == 0
  8. 
.     qui sum `var' if seguimiento == 1 & tratamiento == 0
  9.     replace mean_`var' = r(mean) if seguimiento == 1 & tratamiento == 0
 10. }
(8,931 real changes made)
(7,981 real changes made)
(6,370 real changes made)
(5,449 real changes made)
(8,931 real changes made)
(7,981 real changes made)
(6,370 real changes made)
(5,449 real changes made)

. 
. 
. twoway (line mean_ttrabajo seguimiento if tratamiento == 0, ///
>         lcolor(blue) lpattern(solid) legend(label(1 "No Tratado"))) ///
>        (line mean_ttrabajo seguimiento if tratamiento == 1, ///
>         lcolor(red) lpattern(dash) legend(label(2 "Tratado"))), ///
>        graphregion(color(white)) ///
>        ytitle("Tiempo Promedio Trabajando Fuera del Hogar") ///
>        xlabel(0 1, valuelabel) ///
>        title("Impacto de FeA en Trabajo Infantil")

. 
. 
. twoway (line mean_tayuda seguimiento if tratamiento == 0, ///
>         lcolor(blue) lpattern(solid) legend(label(1 "No Tratado"))) ///
>        (line mean_tayuda seguimiento if tratamiento == 1, ///
>         lcolor(red) lpattern(dash) legend(label(2 "Tratado"))), ///
>        graphregion(color(white)) ///
>        ytitle("Tiempo Promedio Ayudando en el Hogar") ///
>        xlabel(0 1, valuelabel) ///
>        title("Impacto de FeA en Ayuda en el Hogar")

. 
. 
. 
.            
. 
. 
.            
.            
.            
. 
end of do-file

